# Задача 2. Бриллиант
# Входным данным является целое число. Необходимo написать проверку, чтобы в работу пускать только положительные
# нечетные числа, для правильного числа нужно построить бриллиант из звездочек или любых других символов и вывести его
# в консоли. Для числа 1 он выглядит как одна взездочка, для числа три он выглядит как звезда, потом три звезды, потом
# опять одна, для пятерки - звезда, три, пять, три, одна.
def brilliant(num):
    result = ''
    spaces = num // 2  # змінна потрібна для вказання кількості пробілів
    for i in range(1, num + 1, 2):  # шаг 2, бо лише непарні числа від 1 до вказаного num для верхньої частини діаманта
        if num != 2 and num > 0:
            result += ' ' * spaces + '*' * i + '\n'  # кіл-сть пробілів - х, кіл-сть * - і
            spaces -= 1  # кожного разу кіл-сть потрібних пробілів зменшується на 1
    spaces = spaces + 1
    for i in range(1, num, 2)[::-1]:  # нижня reversed частина діаманта, range до num не включно
        if num != 2 and num > 0:
            spaces += 1
            result += ' ' * spaces + '*' * i + '\n'
    return result


print(brilliant(9))
